#import requests
#this is comment
''' many
 comments'''
# 79 - maximum symbols
a = 'this "is" a'  #текстовые данные
#текст через одинарные или двойные кавычки
#внутри одинарных можно использовать двойные
#внутри двойных можно использовать одинарные
#загуглить  знак "\" в пайтон
#конец рядка "просто энтером"
#загуглить область видимости в пайтон (TAB)

number_of_students1 = 12
number_of_students2 = 12
#понятно называть переменные/функции (читабельно)

#для классов CamelCase
class ExampleClassOne():
    pass
#данные изменяемые и не изменяемые (переменные и постоянные)