'''
Задача 3. За введеними координатами з'ясувати, до якої координатної чверті належить точка.
( Координати ввести з консолі, варто зауважити, що це можуть бути не лише цілі числа.
Опрацювати варіант, коли точка- початок координат або лежить на осі )
Намалюйте блок-схему до даної задачі і прикріпіть зображення до домашнього завдання.
'''
x = float(input("Введите X:"))
y = float(input("Введите Y:"))
if x == 0 and y == 0:
    print("точка находится в центре")
elif x == 0:
    print("Точка находится на оси X")
elif y == 0:
    print("Точка находится на оси Y")
elif x > 0 and y > 0:
    print("Точка находится в вверху справа (1)")
elif x < 0 and y > 0:
    print("Точка находится внизу справа (2)")
elif x < 0 and y < 0:
    print("Точка находится внизу слева (3)")
elif x > 0 and y < 0:
    print("Точка находится вверху слева")